In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd

'C:\\Users\\o_dur\\Desktop\\calisma\\udemy'

In [3]:
ls

 Volume in drive C has no label.
 Volume Serial Number is DEA4-F820

 Directory of C:\Users\o_dur\Desktop\calisma\udemy

21.03.2021  18:03    <DIR>          .
21.03.2021  18:03    <DIR>          ..
21.03.2021  18:02    <DIR>          .ipynb_checkpoints
18.03.2021  17:10           184.965 dataFrameExercisesUdemy.ipynb
21.03.2021  17:00            42.763 df-concat_merge_join-Exercises.ipynb
19.03.2021  12:43           189.438 df-GroupBy-MissingData.ipynb
21.03.2021  18:03               724 df-Inputs_Outputs-Exercises.ipynb
21.03.2021  17:20             6.437 df-String-Exercises.ipynb
21.03.2021  18:00            19.446 df-TimeMethods-Exercises.ipynb
05.07.2020  02:39                51 example.csv
26.09.2020  21:14             5.022 example.xlsx
12.07.2020  21:41        25.112.317 hotel_booking_data.csv
18.03.2021  23:39           240.808 matplotlibExercisesUdemy.ipynb
07.02.2020  21:26               177 movie_scores.csv
02.07.2020  00:56            17.727 mpg.csv
05.07.2020  02:58             5.022 my_excel_file.xlsx
18.03.2021  18:44            10.228 myFirstPlot.png
18.03.2021  23:01            24.787 new_figure.png
18.03.2021  23:02            20.029 new_figure_2x2.png
05.07.2020  03:10                51 new_file.csv
26.09.2020  21:05             5.021 new_workbook.xlsx
26.09.2020  02:16                51 newfile.csv
11.07.2020  21:14            52.132 reshaping_pivot.png
03.07.2020  02:56             5.459 RetailSales_BeerWineLiquor.csv
07.07.2020  02:10             1.320 Sales_Funnel_CRM.csv
27.01.2020  23:28            18.752 tips.csv
              23 File(s)     25.962.727 bytes
               3 Dir(s)  54.492.172.288 bytes free

In [4]:
import os

In [5]:
os.getcwd()

'C:\\Users\\o_dur\\Desktop\\calisma\\udemy'

In [10]:
df = pd.read_csv('example.csv', index_col = 1) # index_col = x ile x. sütunun değerlerini index gibi kullanabiliriz.

In [11]:
df

     a   c   d
b
1    0   2   3
5    4   6   7
9    8  10  11
13  12  14  15

In [12]:
df.to_csv('newFile.csv', index = False)

In [14]:
new = pd.read_csv('newFile.csv')

In [15]:
new

    a   c   d
0   0   2   3
1   4   6   7
2   8  10  11
3  12  14  15

In [19]:
df.to_csv('newFile.csv', index = True)

In [20]:
new = pd.read_csv('newFile.csv')

In [21]:
new

    b   a   c   d
0   1   0   2   3
1   5   4   6   7
2   9   8  10  11
3  13  12  14  15

conda install lxml
pip install lxml

In [23]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [24]:
tables = pd.read_html(url)

In [26]:
len(tables)

26

In [27]:
tables[0]

        World population (millions, UN estimates)[14]  \
                                                    #
0                                                   1
1                                                   2
2                                                   3
3                                                   4
4                                                   5
5                                                   6
6                                                   7
7                                                   8
8                                                   9
9                                                  10
10                                                NaN
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                      Top ten most populous countries
0                                            China[B]
1                                               India
2                                       United States
3                                           Indonesia
4                                            Pakistan
5                                              Brazil
6                                             Nigeria
7                                          Bangladesh
8                                              Russia
9                                              Mexico
10                                        World total
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2000
0                                                1270
1                                                1053
2                                                 283
3                                                 212
4                                                 136
5                                                 176
6                                                 123
7                                                 131
8                                                 146
9                                                 103
10                                               6127
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2015
0                                                1376
1                                                1311
2                                                 322
3                                                 258
4                                                 208
5                                                 206
6                                                 182
7                                                 161
8                                                 146
9                                                 127
10                                               7349
11  Notes: .mw-parser-output .reflist{font-size:90...


                                              2030[A]
0                                                1416
1                                                1528
2                                                 356
3                                                 295
4                                                 245
5                                                 228
6                                                 263
7                                                 186
8                                                 149
9                                                 148
10                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...

In [29]:
tables[0].columns

MultiIndex([('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...)],
           )

In [30]:
world_topten = tables[0]

In [32]:
world_topten = world_topten['World population (millions, UN estimates)[14]']

In [33]:
world_topten = world_topten.drop(11, axis = 0)

In [34]:
world_topten

      # Top ten most populous countries  2000  2015 2030[A]
0     1                        China[B]  1270  1376    1416
1     2                           India  1053  1311    1528
2     3                   United States   283   322     356
3     4                       Indonesia   212   258     295
4     5                        Pakistan   136   208     245
5     6                          Brazil   176   206     228
6     7                         Nigeria   123   182     263
7     8                      Bangladesh   131   161     186
8     9                          Russia   146   146     149
9    10                          Mexico   103   127     148
10  NaN                     World total  6127  7349    8501

In [35]:
world_topten = world_topten.drop('#', axis = 1 )

In [36]:
world_topten.columns = ['Country', '200', '2015', '2030 Est.']

In [37]:
world_topten

          Country   200  2015 2030 Est.
0        China[B]  1270  1376      1416
1           India  1053  1311      1528
2   United States   283   322       356
3       Indonesia   212   258       295
4        Pakistan   136   208       245
5          Brazil   176   206       228
6         Nigeria   123   182       263
7      Bangladesh   131   161       186
8          Russia   146   146       149
9          Mexico   103   127       148
10    World total  6127  7349      8501

In [39]:
tables[5].set_index('Rank')

          Country  Population  Area(km2)  Density(pop/km2)
Rank
1       Singapore     5704000        710              8033
2      Bangladesh   170350000     143998              1183
3         Lebanon     6856000      10452               656
4          Taiwan    23604000      36193               652
5     South Korea    51781000      99538               520
6          Rwanda    12374000      26338               470
7           Haiti    11578000      27065               428
8     Netherlands    17570000      41526               423
9          Israel     9330000      22072               423
10          India  1374670000    3287240               418

In [40]:
world_topten.to_html('sample_table.html', index = False)

In [41]:
pd.read_html('sample_table.html')

[          Country   200  2015  2030 Est.
 0        China[B]  1270  1376       1416
 1           India  1053  1311       1528
 2   United States   283   322        356
 3       Indonesia   212   258        295
 4        Pakistan   136   208        245
 5          Brazil   176   206        228
 6         Nigeria   123   182        263
 7      Bangladesh   131   161        186
 8          Russia   146   146        149
 9          Mexico   103   127        148
 10    World total  6127  7349       8501]

In [43]:
df = pd.read_excel('my_excel_file.xlsx', sheet_name = 'First_Sheet')

In [44]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [45]:
wb = pd.ExcelFile('my_excel_file.xlsx')

In [46]:
wb.sheet_names

['First_Sheet']

In [48]:
excel_sheet_dict = pd.read_excel('my_excel_file.xlsx', sheet_name = None)

In [49]:
type(excel_sheet_dict)

dict

In [50]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [51]:
excel_sheet_dict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [53]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [54]:
our_df = excel_sheet_dict['First_Sheet']

In [55]:
our_df.to_excel('example.xlsx', sheet_name = 'First_Sheet', index = False)

In [56]:
pd.read_excel('example.xlsx')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

pip install sqlalchemy

In [57]:
from sqlalchemy import create_engine

In [58]:
temp_db = create_engine('sqlite:///:memory:')

In [61]:
df = pd.DataFrame(data = np.random.randint(0,100,size = (4,4)), columns = ['a','b', 'c', 'd'])

In [62]:
df.to_sql(name = 'new_table', con = temp_db)

In [64]:
df.to_sql(name = 'new_table', con = temp_db) # Already exist hatası.

ValueError: Table 'new_table' already exists.

In [66]:
new_df = pd.read_sql(sql = 'new_table', con = temp_db)

In [68]:
new_df

   index   a   b   c   d
0      0  91  24  47  91
1      1   3  47  40  94
2      2  21   8  65   5
3      3  56  20   6  91

In [69]:
pd.read_sql_query(sql = 'SELECT a,c FROM new_table', con = temp_db)

    a   c
0  91  47
1   3  40
2  21  65
3  56   6